In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame({
    'name':['Rob','Rafiq','Nina',"sofia",'mohan','Tao','Elon Musk'],
    'income':[5000,6000,4000,7500,8000,7000,10000000]
})
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      sofia      7500
4      mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   income  7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 244.0+ bytes

In [10]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [11]:
df.income.quantile(.75)

7750.0

In [13]:
df.income.quantile(.45)

6700.0

In [14]:
df.income.quantile(.25,interpolation='lower')

5000

In [15]:
df.income.quantile(.25,interpolation='higher')

6000

In [16]:
df.income.quantile(.25,interpolation='linear')

5500.0

In [17]:
df.income.quantile(.25)

5500.0

In [19]:
percentile_99=df.income.quantile(.99)
percentile_99

9400479.999999994

In [20]:
df_no_outlier=df[df.income<=percentile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  sofia    7500
4  mohan    8000
5    Tao    7000

the 99th percentile is removed

In [25]:
df['income'][3]=np.NaN
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      sofia         NaN
4      mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [28]:
mean=df.income.mean()
mean

1671666.6666666667

In [29]:
median=df.income.median()
median

6500.0

In [30]:
df_new=df.fillna(median)
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      sofia      6500.0
4      mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0